Rocontento/HomeKey-ESP32/main/NfcManager.cpp
NfcManager::~NfcManager() = default;

/**
 * @brief Initialize the selected NFC reader and start the NFC polling task.
 *
 * Instantiates the correct reader implementation (PN532 or PN7160) and launches
 * the background task that drives NFC polling.
 *
 * @return `true` if the NFC polling task was started, `false` otherwise.
 */
bool NfcManager::begin() {
    const auto& readerGid = m_readerDataManager.reader_identity().group_identifier;
    if (readerGid.size() == 8) {
        memcpy(m_ecpData.data() + 8, readerGid.data(), 8);
        Utils::crc16a(m_ecpData.data(), 16, m_ecpData.data() + 16);
    } else if(readerGid.size() == 0) {
        std::fill(m_ecpData.begin(), m_ecpData.end(), 0);
    }
    if (m_nfcReaderType == 0) {
        m_reader = std::make_unique<Pn532Reader>(nfcGpioPins, m_ecpData);
        ESP_LOGI(TAG, "Using PN532 reader");
    } else if (m_nfcReaderType == 1) {
    	 if (m_nfcIrqPin == 255 || m_nfcVenPin == 255) {
				 ESP_LOGE(TAG, "PN7160 selected but IRQ/VEN pins are unset");
				 return false;
			 }
			m_reader = std::make_unique<Pn7160Reader>(nfcGpioPins, m_nfcIrqPin, m_nfcVenPin, m_ecpData);
			ESP_LOGI(TAG, "Using PN7160 reader");
    } else if (m_nfcReaderType == 2) {
        // I2C: nfcGpioPins[0] = SDA, [1] = SCL. Entries [2]/[3] are unused.
        // Checked here for the same reason the PN7160 branch checks IRQ/VEN:
        // otherwise an unconfigured device reaches i2c_new_master_bus() with
        // sda_io_num = 255 and reports only a generic driver argument error.
        if (nfcGpioPins[0] == 255 || nfcGpioPins[1] == 255) {
            ESP_LOGE(TAG, "ST25R3916 selected but SDA/SCL pins are unset");
            return false;
        }
        m_reader = std::make_unique<St25r3916Reader>(nfcGpioPins, m_ecpData);
        ESP_LOGI(TAG, "Using ST25R3916 reader (I2C)");
    } else {
    	ESP_LOGE(TAG, "Unsupported NFC reader type: %u", m_nfcReaderType);
    	return false;
    }
    ESP_LOGI(TAG, "Auth precompute %s.", m_hkAuthPrecomputeEnabled ? "enabled" : "disabled");
    ESP_LOGI(TAG, "NFC fast polling: %s", m_nfcFastPollingEnabled ? "enabled" : "disabled");
    ESP_LOGI(TAG, "Starting NFC polling task...");
		BaseType_t ok = xTaskCreateUniversal(
				pollingTaskEntry, "nfc_poll_task", 8192, this, 4, &m_pollingTaskHandle, 1);
		if (ok != pdPASS || !m_pollingTaskHandle) {
			ESP_LOGE(TAG, "Failed to create NFC polling task.");
			return false;
		}
		return true;
}

/**
 * @brief Initialize the selected NFC reader and refresh ECP data.
 *
 * Delegates to the active reader's init() method. On success, updates the manager's
 * ECP data buffer.
 *
 * @return `true` if the reader was successfully initialized and ECP data updated, `false` otherwise.
 */
bool NfcManager::initializeReader() {
    if (!m_reader) {
        ESP_LOGE(TAG, "No reader instance available.");
        return false;
    }
    if (!m_reader->init()) {
    		err:
        ESP_LOGE(TAG, "Reader initialization failed.");
        return false;
    }
		if (!m_reader->beginDiscovery()){goto err;}
    ESP_LOGI(TAG, "Reader initialized. Waiting for tags...");
    return true;
}

/**
 * @brief FreeRTOS task entry that dispatches to an instance's polling loop.
 *
 * This static function is used as a task entry point and calls the associated
 * NfcManager instance's pollingTask method.
 *
 * @param instance Pointer to the NfcManager instance whose pollingTask will be executed.
 */
void NfcManager::pollingTaskEntry(void* instance) {
    static_cast<NfcManager*>(instance)->pollingTask();
}

/**
 * @brief Main NFC polling loop that monitors the reader and dispatches tag handling.
 *
 * @details Initializes the NFC reader and then runs indefinitely, repeatedly
 * checking the reader's responsiveness and polling for passive ISO14443A tags.
 * If the reader becomes unresponsive, this task schedules a reconnection retry
 * and suspends itself. When a tag is detected, it invokes the tag handling path
 * and waits for the tag to be removed before continuing normal polling.
 */
void NfcManager::pollingTask() {
    if (!initializeReader()) {
    	while (true) {
    		if (initializeReader()) {
    			ESP_LOGI(TAG, "Reader reconnected successfully.");
    			break;
    		}
    		ESP_LOGW(TAG, "Reconnect attempt failed. Retrying in 5 seconds...");
    		vTaskDelay(pdMS_TO_TICKS(5000));
    	}
    }

    // Host-side cap on how long we wait for InListPassiveTarget to come back.
    // Passive activation retries are 0, so the PN532 makes a single attempt
    // and returns almost immediately; this only bounds a wedged reader.
    const uint16_t passiveTargetTimeoutMs = 150;
    const TickType_t pollDelayTicks =
        pdMS_TO_TICKS(m_nfcFastPollingEnabled ? 5 : 100);

    ESP_LOGI(TAG,
             "NFC poll tuning active: delay=%lu ms, passiveTimeout=%u ms",
             static_cast<unsigned long>(pollDelayTicks * portTICK_PERIOD_MS),
             static_cast<unsigned int>(passiveTargetTimeoutMs));

    while (true) {
        if (m_reconfigRequested.exchange(false, std::memory_order_acq_rel)) {
          ESP_LOGI(TAG, "ECP Frame update requested...");
          if (m_reader) {
              if (!m_reader->updateECP()) {
                  ESP_LOGE(TAG, "ECP update failed; performing full reader re-initialization.");
                  m_reader->stop();
                  if (!initializeReader()) {
                      vTaskDelay(pdMS_TO_TICKS(1000));
                      continue;
                  }
              }
          }
        }

        if (m_hkAuthPrecomputeEnabled) {
            const auto& identity = m_readerDataManager.reader_identity();
            const bool provisioned =
                identity.group_identifier.size() == 8 &&
                !identity.sub_identifier.empty() &&
                !identity.private_key.empty() &&
                !identity.public_key.empty();
            if (provisioned &&
                (!m_cachedSession ||
                 m_cachedSessionGeneration != m_readerDataGeneration.load(std::memory_order_relaxed))) {
                auto startTime = std::chrono::high_resolution_clock::now();
                m_cachedSession = buildAuthSession();
                m_cachedSessionGeneration = m_readerDataGeneration.load(std::memory_order_relaxed);
                ESP_LOGI(TAG, "Auth session precomputed in %lli ms.",
                         std::chrono::duration_cast<std::chrono::milliseconds>(
                             std::chrono::high_resolution_clock::now() - startTime)
                                 .count());
            }
        }
        if (!m_reader->healthCheck()) {
					ESP_LOGE(TAG, "NFC reader is unresponsive. Attempting to reconnect...");
					while (true) {
						if (initializeReader()) {
							ESP_LOGI(TAG, "Reader reconnected successfully.");
							break;
						}
						ESP_LOGW(TAG, "Reconnect attempt failed. Retrying in 5 seconds...");
						vTaskDelay(pdMS_TO_TICKS(5000));
					}
					continue;
        }

        // Post-transaction cooldown: after a HomeKey transaction the phone is
        // often still resting on the reader. Re-activating it immediately
        // starts a second transaction the phone will not complete (it must
        // leave and re-enter the field), which ends in a "flow failed" and an
        // error shown on the phone even though the door already opened.
        if (m_txnCooldownTicks != 0 &&
            (xTaskGetTickCount() - m_lastTxnTick) < m_txnCooldownTicks) {
            vTaskDelay(pollDelayTicks);
            continue;
        }
        m_txnCooldownTicks = 0;

        std::vector<uint8_t> uid;
        std::array<uint8_t,2> atqa;
        uint8_t sak;
        if (m_reader->pollForTag(uid, atqa, sak, passiveTargetTimeoutMs)) {
            ESP_LOGI(TAG, "NFC tag detected!");
            m_lastTxnOutcome = TxnOutcome::None;
            handleTagPresence(uid, atqa, sak);
            waitForTagRemoval();
            if (m_lastTxnOutcome != TxnOutcome::None) {
                m_lastTxnTick = xTaskGetTickCount();
                m_txnCooldownTicks = pdMS_TO_TICKS(
                    m_lastTxnOutcome == TxnOutcome::Success ? kPostSuccessCooldownMs
                                                            : kPostFailureCooldownMs);
                ESP_LOGD(TAG, "Post-transaction cooldown: %u ms",
                         (unsigned)(m_txnCooldownTicks * portTICK_PERIOD_MS));
            }
        }

        vTaskDelay(pollDelayTicks);
        taskYIELD();
    }
}

/**
 * @brief Handles a detected NFC tag by attempting to select the HomeKey applet and processing the tag accordingly.
 *
 * Attempts to select the HomeKey applet on the tag via an APDU select command; if selection succeeds, proceeds with
 * HomeKey authentication handling. If selection fails, reads the tag's UID/ATQA/SAK and processes it as a generic ISO14443A tag.
 * Logs the tag processing duration and releases the reader device state before returning.
 */
void NfcManager::handleTagPresence(const std::vector<uint8_t>& uid, const std::array<uint8_t,2>& atqa, const uint8_t& sak) {
    auto startTime = std::chrono::high_resolution_clock::now();
    const std::vector<uint8_t> selectAppletCmd = { 0x00, 0xA4, 0x04, 0x00, 0x07, 0xA0, 0x00, 0x00, 0x08, 0x58, 0x01, 0x01, 0x00 };

